# GNU utilities
brew "binutils"   # GNU binary tools for native development
brew "coreutils"  # GNU File, Shell, and Text utilities
brew "diffutils"  # File comparison utilities
brew "ed"         # Classic UNIX line editor
brew "findutils"  # Collection of GNU find, xargs, and locate
brew "gnu-sed"    # GNU implementation of the famous stream editor
brew "gnu-tar"    # GNU version of the tar archiving utility
brew "gnu-which"  # GNU implementation of which utility
brew "grep"       # GNU grep, egrep and fgrep
brew "less"       # Pager program similar to more

# Shells
brew "zsh"  # UNIX shell (command interpreter)

# Misc
brew "ghq"      # Remote repository management made easy
brew "mackup"   # Keep your Mac's application settings in sync
brew "nkf"      # Network Kanji code conversion Filter (NKF)
brew "openssh"  # OpenBSD freely-licensed SSH connectivity tools

# CASK
cask_args appdir: "/Applications"
cask "bettertouchtool"
cask "docker"
cask "dropbox"
cask "font-hack-nerd-font"
cask "google-chrome"
cask "google-japanese-ime"
cask "iterm2"
cask "karabiner-elements"
cask "macfuse"
cask "pycharm"
cask "visual-studio-code"
cask "xquartz"
