# TAP
tap "homebrew/cask-fonts"

# GNU utilities
brew "binutils"   # ld, ar, ...
brew "coreutils"  # ls, cp, rm, ...
brew "diffutils"  # diff, cmp, ...
brew "findutils"  # find, locate, updatedb, xargs
brew "less"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-which"
brew "gawk"
brew "ed"
brew "grep"
brew "gzip"

# Misc
brew "ghq"
brew "nkf"
brew "mackup"

# CASK
cask_args appdir: "/Applications"
cask "docker"
cask "google-chrome"
cask "dropbox"
cask "iterm2"
cask "visual-studio-code"
cask "pycharm"
cask "google-japanese-ime"
cask "xquartz"
cask "macfuse"
cask "font-hack-nerd-font"
cask "karabiner-elements"
cask "bettertouchtool"

# MAS
# mas "Slack", id: 803453959  # seems to require being signed in
# mas "LINE", id: 539883307  # seems to require being signed in
# mas "Kindle", id: 405399194  # seems to require being signed in
# mas "Pages", id: 409201541
# mas "Keynote", id: 409183694
# mas "Numbers", id: 409203825
mas "The Unarchiver", id: 425424353
mas "OneDrive", id: 823766827
