# TAP
tap "homebrew/cask-fonts"

# GNU utilities
brew "binutils"   # ld, ar, ...
brew "coreutils"  # ls, cp, rm, ...
brew "diffutils"  # diff, cmp, ...
brew "ed"
brew "findutils"  # find, locate, updatedb, xargs
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-which"
brew "grep"
brew "less"

# Misc
brew "ghq"      # Remote repository management made easy
brew "mackup"   # Keep your Mac's application settings in sync
brew "nkf"      # Network Kanji code conversion Filter (NKF)
brew "openssh"  # OpenBSD freely-licensed SSH connectivity tools

# CASK
cask_args appdir: "/Applications"
cask "bettertouchtool"
cask "docker"
cask "dropbox"
cask "font-hack-nerd-font"
cask "google-chrome"
cask "google-japanese-ime"
cask "iterm2"
cask "karabiner-elements"
cask "macfuse"
cask "pycharm"
cask "visual-studio-code"
cask "xquartz"
