# Basic CLI tools
brew "cmake"
brew "curl"
brew "gcc"
brew "meson"
brew "wget"
brew "gawk"
brew "gzip"

# Shells
brew "bash"
# brew "zsh"  # Zsh 5.9 is not compatible with Zsh 5.8

# Editors
brew "emacs"
brew "vim"

# Programming languages
brew "go"
brew "node"
brew "node@16"
brew "perl"
brew "python"
brew "python@3.11"
brew "python@3.10"
brew "python@3.9"
brew "ruby", args: ["force-bottle"]
# Rust is installed via rustup

# Modern alternatives to Liunx CLI tools
brew "bat"        # cat
brew "colordiff"  # diff
brew "duf"        # df
brew "fd"         # find
brew "git"        # git
brew "git-delta"  # diff
brew "htop"       # top
brew "lsd"        # ls
brew "openssh"    # ssh
brew "procs"      # ps
brew "rargs"      # Util like xargs + awk with pattern matching support
brew "ripgrep"    # grep -r
brew "sd"         # sed/awk
brew "tmux"       # tmux
brew "xz"         # xz

# Misc
tap "nobu-g/tap"
tap "ko1nksm/getoptions"
brew "atuin"       # Improved shell history for zsh and bash
brew "direnv"      # Load/unload environment variables based on $PWD
brew "fzf"         # Command-line fuzzy finder written in Go
brew "getoptions"  # An elegant option parser for shell scripts
brew "jq"          # Lightweight and flexible command-line JSON processor
brew "moreutils"   # chronic, combine, ifne, sponge, ...
brew "peco"        # Simplistic interactive filtering tool
brew "pipx"        # Execute binaries from Python packages in isolated environments
brew "stderred"    # Stderr in red
brew "tree"        # Display directories as trees (with optional color/HTML output)
brew "watch"       # Executes a program periodically, showing output fullscreen
brew "zoxide"      # Shell extension to navigate your filesystem faster

# System
brew "whois"      # Lookup tool for domain names and other internet resources
brew "nmap"       # Port scanning utility for large networks
